"""
Задача 2.

Напишите программу, в окно которой пользователь сможет ввести названия
двух своих любимых блюд. Программа должна сцеплять две эти строки и выводить
полученную строку как название нового невиданного блюда.
"""

first_fav = input('Введите первое любимое блюдо: ')
second_fav = input('Введите второе любимое блюдо: ')
print(first_fav + second_fav)