"""
Задание 1. Выведите значение возраста из словаря person.

# данный код
person = {"name": "Kelly", "age":25, "city": "New york"}
# требуемый вывод:
# 25
"""

person = {'name': 'Kelly', 'age': 25, 'city': 'New york'}
print(person['age'])